Revit 2027 API
MEPNetworkSegmentData.SectionNumber Property
 The section this segment belongs to.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SectionNumber { get; }
Public ReadOnly Property SectionNumber As Integer
	Get
public:
property int SectionNumber {
	int get ();
}
member SectionNumber : int with get
Property Value
Int32
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace